    Madi Susan Subaiti 

    Titnic Dataset Assignment 
    Python

#1 Read the dataset correctly using pandas, using an appropriate column as index (1 point)

In [1]:
import numpy as np
import pandas as pd
import os

In [43]:
#1 - 

DATA_DIRECTORY= "data/"
titanic_train_csv = os.path.join(DATA_DIRECTORY,"train.csv")

titanic_df = pd.read_csv(
    titanic_train_csv,
    index_col="PassengerId"
)

In [44]:
#creating a copy of the dataset to later use when needed

titanic_df1 = titanic_df.copy()

In [45]:
titanic_df1.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
######################

# 2 a) Compute the percentage of survivors out of total number of passengers

In [46]:
#total survivors 

titanic_survivors = titanic_df["Survived"].sum()
titanic_survivors

342

In [47]:
#total passengers 

titanic_passengers = titanic_df["Survived"].count()
titanic_passengers

891

In [48]:
# getting percentage of survivors from total 

per_survivors = (titanic_survivors/titanic_passengers) *100
per_survivors

38.38383838383838

In [49]:
#Or in one line using the mean:

titanic_surv = titanic_df["Survived"].mean()
titanic_surv

0.3838383838383838

In [10]:
######################

#2 b) The percentage of men and women out of total number of passengers

In [58]:
#finding number of males 
sex_m = titanic_df.loc[titanic_df.Sex == "male", "Sex"].count()
sex_m

577

In [51]:
#finding % of males out of total passengers
male_survivors = (sex_m/titanic_passengers)*100
male_survivors

64.75869809203144

In [52]:
#finding number of females
sex_f = titanic_df.loc[ttnc.Sex == "female", "Sex"].count()
sex_f

314

In [53]:
#finding % of females out of total passengers
female_survivors = (sex_f/titanic_passengers)*100
female_survivors

35.24130190796858

In [15]:
######################

#3 a) 
Compute the percentage of survivors by sex (i.e. the percentage of male passengers that survived and female passengers that survived)

In [55]:
#finding number of survivors per gender
surviving_genders = titanic_df.groupby(
    titanic_df["Sex"]).sum()
surviving_genders = genders.iloc[:,0:1]
surviving_genders

        Survived
Sex
female       233
male         109

In [62]:
#computing the % of each gender to total number of passengers 

grouped_gender_total=titanic_df.groupby('Sex').size().reset_index(name='Total Count of Genders')
grouped_gender_total

      Sex  Count
0  female    314
1    male    577

In [18]:
######################

#3 b) 
the percentage of survivors that were men and women

In [64]:
#computing the percentage of women and men out of the total survivors
percent_surviving_gender = (surviving_genders/titanic_passengers)*100
percent_surviving_gender = percent_surviving_gender.iloc[:,0:1]
percent_surviving_gender

         Survived
Sex
female  26.150393
male    12.233446

In [20]:
######################

# 4 a)
Display in a 2 x 2 DataFrame with the probability of being male/female and surviving/not surviving

In [65]:
#creating a groupby with Sex and Survived, and unstacking the survived column to count them 
#and get the percentage of Female and Male out of total survivors

# Groupby Sex and Survived, and unstack the Survived column
grouped_gender_survive = titanic_df.groupby(['Sex', 'Survived']).size().unstack()

# Calculate total count and probabilities
total_count = grouped_gender_survive.sum().sum()
grouped_gender_survive['Survived %'] = (grouped_gender_survive[1] / total_count) * 100
grouped_gender_survive['Not Survived %'] = (grouped_gender_survive[0] / total_count) * 100

# Create a 2 x 2 DataFrame with probabilities
probability_df = pd.DataFrame({
    'Survived %': [grouped_gender_survive.loc['female', 1], grouped_gender_survive.loc['male', 1]],
    'Not Survived %': [grouped_gender_survive.loc['female', 0], grouped_gender_survive.loc['male', 0]]
}, index=['Female', 'Male'])

probability_df

        Survived %  Not Survived %
Female         233              81
Male           109             468

In [67]:
probability_df.columns

Index(['Survived %', 'Not Survived %'], dtype='object')

In [68]:
probability_df.iloc[:,0:1]

        Survived %
Female         233
Male           109

In [69]:
probability_df.reset_index()

    index  Survived %  Not Survived %
0  Female         233              81
1    Male         109             468

In [84]:
titanic_crosstab = pd.crosstab(titanic_df['Age'], titanic_df['Sex'], normalize=False)
titanic_crosstab.head()

Sex   female  male
Age
0.42       0     1
0.67       0     1
0.75       2     0
0.83       0     2
0.92       0     1

In [37]:
#######################################

# 4 b)
Display in a DataFrame the probability of survival/not survival of all combinations of sex and class (0.5 points)

In [80]:
# Grouping by Sex and PClass as well as Survived in order to then Unstack Survived to count in based on gender

group_sex_class= titanic_df.groupby([
    'Sex',"Pclass", "Survived"])["Survived"].count().unstack("Survived")/ttnc["Survived"].count()
group_sex_class

Survived              0         1
Sex    Pclass
female 1       0.003367  0.102132
       2       0.006734  0.078563
       3       0.080808  0.080808
male   1       0.086420  0.050505
       2       0.102132  0.019080
       3       0.336700  0.052750

In [ ]:
######################

Part II: Imputing missing values (2 points)

Devise some strategy to impute the missing values in the Age column.

You cannot use machine learning algorithms for the feature engineering part, only manual techniques. This rules out KNN, Deep Learning, sklearn.preprocessing.Imputer, fancyimpute, missingno, and similar.

Some basic ideas (that should be improved):

Fill all the missing values with random values (very bad!)
Fill all the missing values with the average age of the whole dataset (bad!)
Fill all the missing values with the median age (so so)
Extra grading

One extra point will be awarded for:

Compliance with PEP8 (without it, no other aspect will be considered for extra grading)
Explanations in text (preferably Markdown)
Code comments where appropriate
Overall presentation

In [86]:
#finding the missing ages 

missing_ages = titanic_df1[titanic_df1['Age'].isnull()]
missing_ages.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q

In [87]:
# get mean age of Sex and Pclass
avg_ages = titanic_df1.groupby(['Sex','Pclass'])['Age'].mean()
avg_ages

Sex     Pclass
female  1         34.611765
        2         28.722973
        3         21.750000
male    1         41.281386
        2         30.740707
        3         26.507589
Name: Age, dtype: float64

In [91]:
# create a loop function to remove NAN in age column 
# and replace with the average cooresponding age of the Sex and Pclass (using the copy of the dataset) 

def null_age_x(row):
    if pd.isnull(row['Age']):
        return avg_ages[row['Sex'],row['Pclass']]
    else:
        return row['Age']

titanic_df1["Age"] = titanic_df1.apply(null_age_x, axis=1)
titanic_df1.head()
#print (round(titanic_df1['Age_test']))

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [92]:
#to check if the NaN´s are gone

titanic_df1.isnull().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age           0
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

In [94]:
#Printing the Titanic dataset copy with ages adjusted and cleaned. 

titanic_df1.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S